{
  "posts": [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode"
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "testimonials": [
    {
      "id": "2",
      "message": "AlgoExpert was my go-to course to ace those coding interviews. I really liked the depth of explanation in the video tutorials and the user-friendly interface. I guess AlgoExpert and a lot of hard work makes everything possible (journey from pre-sales to development)!"
    },
    {
      "id": "3",
      "message": "I would just like to point out that AlgoExpert helped me a lot to get an offer from Amazon - UK office (I accepted it). I think that AlgoExpert has everything you need in one place. It covers all important topics. I especially like the possibility to see hints in order to get an idea for the solution or to check the whole video explanation if necessary (which is very well explained!). You can literally prepare the whole coding part of the interview without changing the web browser tab."
    },
    {
      "id": "4",
      "message": "After reading a book on algorithms and data structures, I purchased AlgoExpert to prepare for interviews. Guys, seriously, this is an amazing product! I went through the questions at least 5 times before my interview. Now I am working at Google as a SWE. I honestly couldn't have gotten the offer without this product."
    },
    {
      "id": "5",
      "message": "AlgoExpert was instrumental to me getting the job at Microsoft. I was going through different sites and applications to help in my study of algorithms and data structures, but nothing was as thorough and clear as AlgoExpert. I am now starting as a Site Reliability Engineer II at Microsoft, thanks to this site!"
    },
    {
      "id": "6",
      "message": "AlgoExpert helped me build a very solid foundation to tackle most of the common problems you can encounter during the interview. The most valuable feature, by far, is the video walkthroughs for each problem which makes you understand how to approach the problem. If you want to build/improve your toolset for solving problems, AlgoExpert is worth every penny. Well done."
    },
    {
      "id": "7",
      "message": "There are many platforms I tried out, but nothing taught me the problem solving skillset. They just directly jump into the solution without the why and the how. AlgoExpert has helped me transition from a service based company to a FANG company. Loads of love for the platform and of course to Clement as well."
    },
    {
      "id": "8",
      "message": "When I got the opportunity to interview at Google, I wasn't sure my skills were up to the task. The problems here really helped me brush up on some topics I hadn't covered for a long time during my time in the industry, and really gave me the confidence to go into my interviews knowing that I'd be able to give them my best. Thanks to AlgoExpert, I was able to get an offer with a significant salary increase from my last position!"
    },
    {
      "id": "9",
      "message": "AlgoExpert provides highly tailored problems and explanations that have definitely improved my problem solving abilities. It has given me the insight on how to think efficiently during an interview and how to tackle new and challenging problems."
    },
    {
      "id": "10",
      "message": "I used AlgoExpert to prepare for my coding interviews, and even though I was no where close to finishing all the problems, I had gained so much knowledge from the little that I did learn. With that alone it gave me more confidence to go into my interviews, and be able to problem solve on the spot without memorization, and now I'm doing great work at IBM working on a product that gets used by hundreds of millions daily. AlgoExpert is great for learning how to approach and solve problems, not just to memorize solutions. Thanks to all that work on this product."
    },
    {
      "id": "11",
      "message": "Thank you AlgoExpert team! After using the product I was able to perform well with confidence at multiple FANG on-sites and secure an offer at a hot startup. No joke, every question I got was a variation of something on the platform. Both Algo and System Design Expert gave me the tools needed to ace the interviews! Also, a shoutout to the behavior section. Super helpful, especially when applying to a smaller company where culture fit is so important. The AlgoExpert platform will be my go to for all future interviews. Cheers!"
    },
    {
      "id": "12",
      "message": "Thanks a lot to Algo/Systems Expert for the honest and well-tailored content, I could land a job at my dream company (Google). Your platform helped me to gain confidence and believe in myself. There are an overwhelming amount of resources for interview preparation out there but I would say sys/algo expert is the best among them!!"
    },
    {
      "id": "13",
      "message": "I used AlgoExpert and SystemsExpert to prepare for my coding interviews and I got successfully an offer from the company I work today in San Francisco. I'm so satisfied about how clean and simple these products are built! Will definitely keep answering code questions to keep me in shape in the future!"
    },
    {
      "id": "14",
      "message": "I used AlgoExpert to prepare for my coding + system design interviews at Facebook and Amazon and I got an offer from both companies! Ended up taking the L1 offer from Facebook. The material presented in AlgoExpert and especially SystemsExpert was incredibly useful and very pertinent to the interview rounds that I experienced. Highly recommended!"
    },
    {
      "id": "15",
      "message": "I was using AlgoExpert in my toolkit for interview prep to refresh myself after a few years of full-time motherhood. The curated problem selection and thoughtful problem design in AlgoExpert allowed me to rekindle the problem solving intuition for top-tier tech interviewing very quickly. Thank you for providing this service at an affordable price!"
    },
    {
      "id": "16",
      "message": "I initially purchased both AlgoExpert and SystemsExpert just to get some mock practice ahead of technical interviews. To my pleasant surprise, its content was so holistic that I can confidently say that this platform was the bedrock of my coding and system design interview preparation. \n\nThe solutions on AlgoExpert are not only in depth but cultivate a natural sense of optimizing an often simple (naïve) brute force approach to an optimal one. This is very close to expectations in an actual coding interview. In addition, the course on systems expert is very well structured. I have yet to find a more consolidated platform that not only gives you a breadth of coverage in distributed systems but also walks you through some actual system design question in an interactive manner. \n\nThe real cherry on the top was that some of my phone screens were waived because the recruiters were aware of AlgoExpert assessments/profile :) It literally helped me get fast tracked straight to the on-sites at some of the top companies and expedited the interview process.\n\nA few months ago, I wouldn't have thought about acing my technical interviews at top companies, let alone landing offers from most of them. I just received an offer from Google and I can gladly say that AlgoExpert played a massive part in accomplishing this endeavor. Best investment I ever made. "
    },
    {
      "id": "17",
      "message": "AlgoExpert taught me how to analyze problems and develop my intuition for many solutions. The videos went in great depth of different concepts and familiarized me with various algorithms and data structures. It was quite easy to verbalize my thoughts and speak while coding, and I blew my interviews out of the park! This is a great product I would highly recommend especially to beginners, because it strengthened my fundamentals and gave my problem solving a boost."
    },
    {
      "id": "18",
      "message": "I used AlgoExpert and SystemsExpert to help with my Interview Prep for both Google and Spotify. While I unfortunately did not receive an offer from Google, that was primarily a bit due to nerves and a bit of bad luck. AlgoExpert and SystemsExpert helped prepare me for a seamless first time pass at Spotify (my dream company since college). The strength of this platform lies in the explanations that Clement provides. He is one of the best in the Interview Prep domain at explaining things. Almost all of my knowledge in terms of tackling a System Design interview comes from here and I am extremely grateful for having found the platform. Thanks for everything and best of luck."
    },
    {
      "id": "19",
      "message": "Hey Clement, first of all, thank you! Four months ago I didn't see myself working at a big tech company. AlgoExpert helped me not only improve my coding skills, but also helped me to gain more confidence and that all I needed was practice and a good platform that helped me to understand how to solve these kind of problems. Thanks again and hope this platform gets bigger and bigger!"
    },

    {"id": "20",
      "message": "Coding interviews used to scare me more than spiders (and that's saying a lot)! I found AlgoExpert about a month before my final round with HBO and was able to put in about 30 hours of practice with various categories. I think my favorite thing about the questions is how great a representation they are of what 's being tested out there in the real world. I went into my interview more confident than ever and was able to secure a full-time offer before graduation, thanks in large part to AlgoExpert!"
    },
    {
      "id": "21",
      "message": "There are many resources out there nowadays for coding interviews, like Cracking The Coding Interview and LeetCode. I love both of these products and I think they are high quality. But for someone like me who is a visual learner, they didn't hit the mark. There is no other platform that gives you a curated library of video explanations for each answer. CTCI had answers in one language (obviously written in a book). LeetCode had user defined answers which could be hit or miss and not written with standard coding guidelines. You could try to find YouTube explanations for the problem you're on, but this takes time and if you're doing interview prep, chances are time is limited. AlgoExpert really is perfect for having all of your needs in one places, a true curated library. If you're a visual learner like me, then AlgoExpert is the go-to!"
    },
    {
      "id": "22",
      "message": "I'm a 25 years old Mexican Engineer, finding opportunities in global companies is hard, there are not many vacancies in here. So I purchased AlgoExpert expecting to be ready just in case the opportunity came. I learned and trained for over a year. Just for fun and with the goal in mind to some day have a job abroad. But one day I applied for a new vacancy Google is opening at Mexico City's offices. And I got to follow the process with such great results, I received a full time job offer. This new job represents an improvement in quality of life and opportunities as well as a good step forward in my life project. Without a doubt if that was possible it was because of the help AlgoExpert gives."
    },
    {
      "id": "23",
      "message": "After using this platform for just a couple of months I was able to pass the interview process to Amazon AWS, solving all the problems that were introduced to me during the interviews. I do not believe I would've done it before I started using AlgoExpert. I plan to use this platform in the future in order to further develop my problem solving skills. My big thank you to the AlgoExpert team!"
    },
    {
      "id": "24",
      "message": "Hi Clement and Team, I bought AlgoExpert and SystemsExpert last year in November and I'm happy to let you know that I've landed an E5 Software Engineer position at Facebook and I'll be starting in a couple of weeks. AlgoExpert gave me the coding foundations I needed and SystemsExpert sharpened my design skills. Thanks a lot guys! Be blessed."
    },
    {
      "id": "25",
      "message": "A month before my interview, I completed 100 coding questions on AlgoExpert. I really liked the questions as the questions were very interview specific. The solutions are also detailed and well explained. A big thanks to the whole team of AlgoExpert for such a wonderful content. I am happy to be a part of Microsoft now."
    },
    {
      "id": "26",
      "message": "I initially purchased both AlgoExpert and SystemsExpert just to get some mock practice ahead of technical interviews. To my pleasant surprise, its content was so holistic that I can confidently say that this platform was the bedrock of my coding and system design interview preparation. \n\nThe solutions on AlgoExpert are not only in depth but cultivate a natural sense of optimizing an often simple (naïve) brute force approach to an optimal one. This is very close to expectations in an actual coding interview. In addition, the course on systems expert is very well structured. I have yet to find a more consolidated platform that not only gives you a breadth of coverage in distributed systems but also walks you through some actual system design question in an interactive manner. \n\nThe real cherry on the top was that some of my phone screens were waived because the recruiters were aware of AlgoExpert assessments/profile :) It literally helped me get fast tracked straight to the on-sites at some of the top companies and expedited the interview process.\n\nA few months ago, I wouldn't have thought about acing my technical interviews at top companies, let alone landing offers from most of them. I just received an offer from Google and I can gladly say that AlgoExpert played a massive part in accomplishing this endeavor. Best investment I ever made. "
    },
    {
      "id": "27",
      "message": "AlgoExpert taught me how to analyze problems and develop my intuition for many solutions. The videos went in great depth of different concepts and familiarized me with various algorithms and data structures. It was quite easy to verbalize my thoughts and speak while coding, and I blew my interviews out of the park! This is a great product I would highly recommend especially to beginners, because it strengthened my fundamentals and gave my problem solving a boost."
    },
    {
      "id": "28",
      "message": "I used AlgoExpert and SystemsExpert to help with my Interview Prep for both Google and Spotify. While I unfortunately did not receive an offer from Google, that was primarily a bit due to nerves and a bit of bad luck. AlgoExpert and SystemsExpert helped prepare me for a seamless first time pass at Spotify (my dream company since college). The strength of this platform lies in the explanations that Clement provides. He is one of the best in the Interview Prep domain at explaining things. Almost all of my knowledge in terms of tackling a System Design interview comes from here and I am extremely grateful for having found the platform. Thanks for everything and best of luck."
    },
    {
      "id": "29",
      "message": "Hey Clement, first of all, thank you! Four months ago I didn't see myself working at a big tech company. AlgoExpert helped me not only improve my coding skills, but also helped me to gain more confidence and that all I needed was practice and a good platform that helped me to understand how to solve these kind of problems. Thanks again and hope this platform gets bigger and bigger!"
    },

    {"id": "30",
      "message": "Coding interviews used to scare me more than spiders (and that's saying a lot)! I found AlgoExpert about a month before my final round with HBO and was able to put in about 30 hours of practice with various categories. I think my favorite thing about the questions is how great a representation they are of what 's being tested out there in the real world. I went into my interview more confident than ever and was able to secure a full-time offer before graduation, thanks in large part to AlgoExpert!"
    },
    {
      "id": "42",
      "message": "AlgoExpert was my go-to course to ace those coding interviews. I really liked the depth of explanation in the video tutorials and the user-friendly interface. I guess AlgoExpert and a lot of hard work makes everything possible (journey from pre-sales to development)!"
    },
    {
      "id": "43",
      "message": "I would just like to point out that AlgoExpert helped me a lot to get an offer from Amazon - UK office (I accepted it). I think that AlgoExpert has everything you need in one place. It covers all important topics. I especially like the possibility to see hints in order to get an idea for the solution or to check the whole video explanation if necessary (which is very well explained!). You can literally prepare the whole coding part of the interview without changing the web browser tab."
    },
    {
      "id": "44",
      "message": "After reading a book on algorithms and data structures, I purchased AlgoExpert to prepare for interviews. Guys, seriously, this is an amazing product! I went through the questions at least 5 times before my interview. Now I am working at Google as a SWE. I honestly couldn't have gotten the offer without this product."
    },
    {
      "id": "45",
      "message": "AlgoExpert was instrumental to me getting the job at Microsoft. I was going through different sites and applications to help in my study of algorithms and data structures, but nothing was as thorough and clear as AlgoExpert. I am now starting as a Site Reliability Engineer II at Microsoft, thanks to this site!"
    },
    {
      "id": "46",
      "message": "AlgoExpert helped me build a very solid foundation to tackle most of the common problems you can encounter during the interview. The most valuable feature, by far, is the video walkthroughs for each problem which makes you understand how to approach the problem. If you want to build/improve your toolset for solving problems, AlgoExpert is worth every penny. Well done."
    },
    {
      "id": "47",
      "message": "There are many platforms I tried out, but nothing taught me the problem solving skillset. They just directly jump into the solution without the why and the how. AlgoExpert has helped me transition from a service based company to a FANG company. Loads of love for the platform and of course to Clement as well."
    },
    {
      "id": "48",
      "message": "When I got the opportunity to interview at Google, I wasn't sure my skills were up to the task. The problems here really helped me brush up on some topics I hadn't covered for a long time during my time in the industry, and really gave me the confidence to go into my interviews knowing that I'd be able to give them my best. Thanks to AlgoExpert, I was able to get an offer with a significant salary increase from my last position!"
    },
    {
      "id": "49",
      "message": "AlgoExpert provides highly tailored problems and explanations that have definitely improved my problem solving abilities. It has given me the insight on how to think efficiently during an interview and how to tackle new and challenging problems."
    },
    {
      "id": "50",
      "message": "I used AlgoExpert to prepare for my coding interviews, and even though I was no where close to finishing all the problems, I had gained so much knowledge from the little that I did learn. With that alone it gave me more confidence to go into my interviews, and be able to problem solve on the spot without memorization, and now I'm doing great work at IBM working on a product that gets used by hundreds of millions daily. AlgoExpert is great for learning how to approach and solve problems, not just to memorize solutions. Thanks to all that work on this product."
    },
    {
      "id": "51",
      "message": "Thank you AlgoExpert team! After using the product I was able to perform well with confidence at multiple FANG on-sites and secure an offer at a hot startup. No joke, every question I got was a variation of something on the platform. Both Algo and System Design Expert gave me the tools needed to ace the interviews! Also, a shoutout to the behavior section. Super helpful, especially when applying to a smaller company where culture fit is so important. The AlgoExpert platform will be my go to for all future interviews. Cheers!"
    },
    {
      "id": "52",
      "message": "Thanks a lot to Algo/Systems Expert for the honest and well-tailored content, I could land a job at my dream company (Google). Your platform helped me to gain confidence and believe in myself. There are an overwhelming amount of resources for interview preparation out there but I would say sys/algo expert is the best among them!!"
    },
    {
      "id": "53",
      "message": "I used AlgoExpert and SystemsExpert to prepare for my coding interviews and I got successfully an offer from the company I work today in San Francisco. I'm so satisfied about how clean and simple these products are built! Will definitely keep answering code questions to keep me in shape in the future!"
    },
    {
      "id": "54",
      "message": "I used AlgoExpert to prepare for my coding + system design interviews at Facebook and Amazon and I got an offer from both companies! Ended up taking the L5 offer from Facebook. The material presented in AlgoExpert and especially SystemsExpert was incredibly useful and very pertinent to the interview rounds that I experienced. Highly recommended!"
    },
    {
      "id": "55",
      "message": "I was using AlgoExpert in my toolkit for interview prep to refresh myself after a few years of full-time motherhood. The curated problem selection and thoughtful problem design in AlgoExpert allowed me to rekindle the problem solving intuition for top-tier tech interviewing very quickly. Thank you for providing this service at an affordable price!"
    },
    {
      "id": "56",
      "message": "I initially purchased both AlgoExpert and SystemsExpert just to get some mock practice ahead of technical interviews. To my pleasant surprise, its content was so holistic that I can confidently say that this platform was the bedrock of my coding and system design interview preparation. \n\nThe solutions on AlgoExpert are not only in depth but cultivate a natural sense of optimizing an often simple (naïve) brute force approach to an optimal one. This is very close to expectations in an actual coding interview. In addition, the course on systems expert is very well structured. I have yet to find a more consolidated platform that not only gives you a breadth of coverage in distributed systems but also walks you through some actual system design question in an interactive manner. \n\nThe real cherry on the top was that some of my phone screens were waived because the recruiters were aware of AlgoExpert assessments/profile :) It literally helped me get fast tracked straight to the on-sites at some of the top companies and expedited the interview process.\n\nA few months ago, I wouldn't have thought about acing my technical interviews at top companies, let alone landing offers from most of them. I just received an offer from Google and I can gladly say that AlgoExpert played a massive part in accomplishing this endeavor. Best investment I ever made. "
    },
    {
      "id": "57",
      "message": "AlgoExpert taught me how to analyze problems and develop my intuition for many solutions. The videos went in great depth of different concepts and familiarized me with various algorithms and data structures. It was quite easy to verbalize my thoughts and speak while coding, and I blew my interviews out of the park! This is a great product I would highly recommend especially to beginners, because it strengthened my fundamentals and gave my problem solving a boost."
    },
    {
      "id": "58",
      "message": "I used AlgoExpert and SystemsExpert to help with my Interview Prep for both Google and Spotify. While I unfortunately did not receive an offer from Google, that was primarily a bit due to nerves and a bit of bad luck. AlgoExpert and SystemsExpert helped prepare me for a seamless first time pass at Spotify (my dream company since college). The strength of this platform lies in the explanations that Clement provides. He is one of the best in the Interview Prep domain at explaining things. Almost all of my knowledge in terms of tackling a System Design interview comes from here and I am extremely grateful for having found the platform. Thanks for everything and best of luck."
    },
    {
      "id": "59",
      "message": "Hey Clement, first of all, thank you! Four months ago I didn't see myself working at a big tech company. AlgoExpert helped me not only improve my coding skills, but also helped me to gain more confidence and that all I needed was practice and a good platform that helped me to understand how to solve these kind of problems. Thanks again and hope this platform gets bigger and bigger!"
    },
    {
      "id": "60",
      "message": "Coding interviews used to scare me more than spiders (and that's saying a lot)! I found AlgoExpert about a month before my final round with HBO and was able to put in about 30 hours of practice with various categories. I think my favorite thing about the questions is how great a representation they are of what 's being tested out there in the real world. I went into my interview more confident than ever and was able to secure a full-time offer before graduation, thanks in large part to AlgoExpert!"
    },
    {
      "id": "61",
      "message": "There are many resources out there nowadays for coding interviews, like Cracking The Coding Interview and LeetCode. I love both of these products and I think they are high quality. But for someone like me who is a visual learner, they didn't hit the mark. There is no other platform that gives you a curated library of video explanations for each answer. CTCI had answers in one language (obviously written in a book). LeetCode had user defined answers which could be hit or miss and not written with standard coding guidelines. You could try to find YouTube explanations for the problem you're on, but this takes time and if you're doing interview prep, chances are time is limited. AlgoExpert really is perfect for having all of your needs in one places, a true curated library. If you're a visual learner like me, then AlgoExpert is the go-to!"
    },
    {
      "id": "62",
      "message": "I'm a 25 years old Mexican Engineer, finding opportunities in global companies is hard, there are not many vacancies in here. So I purchased AlgoExpert expecting to be ready just in case the opportunity came. I learned and trained for over a year. Just for fun and with the goal in mind to some day have a job abroad. But one day I applied for a new vacancy Google is opening at Mexico City's offices. And I got to follow the process with such great results, I received a full time job offer. This new job represents an improvement in quality of life and opportunities as well as a good step forward in my life project. Without a doubt if that was possible it was because of the help AlgoExpert gives."
    },
    {
      "id": "63",
      "message": "After using this platform for just a couple of months I was able to pass the interview process to Amazon AWS, solving all the problems that were introduced to me during the interviews. I do not believe I would've done it before I started using AlgoExpert. I plan to use this platform in the future in order to further develop my problem solving skills. My big thank you to the AlgoExpert team!"
    },
    {
      "id": "64",
      "message": "Hi Clement and Team, I bought AlgoExpert and SystemsExpert last year in November and I'm happy to let you know that I've landed an E5 Software Engineer position at Facebook and I'll be starting in a couple of weeks. AlgoExpert gave me the coding foundations I needed and SystemsExpert sharpened my design skills. Thanks a lot guys! Be blessed."
    },
    {
      "id": "65",
      "message": "A month before my interview, I completed 100 coding questions on AlgoExpert. I really liked the questions as the questions were very interview specific. The solutions are also detailed and well explained. A big thanks to the whole team of AlgoExpert for such a wonderful content. I am happy to be a part of Microsoft now."
    },
    {
      "id": "66",
      "message": "Hi Clement, I was finally able to land my dream job at Google, thanks to AlgoExpert. I have to say that the course is really well prepared. Thanks."
    },
    {
      "id": "67",
      "message": "This is an excellent resource! I made it to the HC stage at Google, and got offers from Facebook and Amazon. Thank you so much!"
    },
    {
      "id": "68",
      "message": "Clement (and team), thank you so so much for creating such an incredible product. The videos that you add to each problem are so helpful and I have never seen anything as useful as SystemsExpert when it comes to onsite interview prep. For about 8 years I struggled to move from an SDET/QA role to a true Software Dev role. I had tons of opportunities but almost always choked. Finally I started getting better at algorithms and I'd occasionally get to an onsite. However, once there my lack of experience with systems would show up and I would falter and leave without an offer (I also usually messed up an algorithm somewhere along the way too). AlgoExpert/SystemsExpert changed all of that for me. I finally was able to secure a software developer role and six months later, I got an offer from my dream company, Amazon. I am so excited to start building there and I owe so much of my newfound success to what I learned on this product."
    },
    {
      "id": "69",
      "message": "I've used AlgoExpert for years. When the product was released, I noticed I have more success w/ interviews. Every time I had a big interview, I knew I got that success b/c of using AlgoExpert / SystemsExpert. I would focus on company specific questions, find the topics relevant on AlgoExpert and just go ham. Really ensuring I understood the time, space, and trade offs of everything. When I finally landed 2 job offers (1 from Apple, 1 from Bloomberg), I 1000% percent credit this service. It is by far the service I have come to love over the years. I've recommended this service and will continue to recommend AlgoExpert / SystemsExpert to anyone I know preparing for their coding interviews (w/ the code CLEM for a discount on the platform ;)) Even though I have an amazing job now, I'll still be a loyal customer for years to come!!!"
    },
    {
      "id": "70",
      "message": "Hey Clément, it's a long due thank you note to you and the team of AlgoExpert & SystemsExpert. I switched job in Feb 2021 and joined Amazon Bangalore as SDE-III. For reasons parked for another day's discussion 🙂, my Amazon journey didn't go as per my expectations. Thus I switched job again in August 2021 and joined Uber Bangalore as Sr Software Engineer II. In other words within 6 months I had 2 job switches in 2 of the reputed Tech giants. And guess what? I attribute 80-90% of my tech interview preparation credit to the awesome platform you guys have created. \"Powered by AlgoExpert\", I feel like cracking interviews is not that of a big deal now 😉 which gives me the choice to pick and choose the job that I like the most! Thank you once again - as I said it was a long due one. Keep doing the great work!"
    },
    {
      "id": "71",
      "message": "I purchased your SystemsExpert course in preparation for a Google L6 Eng. Manager role. I'm pleased to say I crushed those two interviews and have officially accepted an offer with a team in my ideal city. Big thanks to the team for your content! It's clearly working!"
    },
    {
      "id": "72",
      "message": "I learned about SystemsExpert after watching one of Clement's free YouTube videos on System Design. I really liked the interview format that he used for tackling the problem so I figured I'd try SystemsExpert, which also uses that style. One of the things that I really got out of it was conveying confidence and using a very collaborative style while answering these questions. This tool was a big part of my successful interview prep and I'm very grateful to Clement and his team for creating this. Thanks guys!"
    },
    {
      "id": "73",
      "message": "Hi Clement and team, I am glad I came across AlgoExpert, I have never faced any systems design interviews before but here I am, landed on Google (L5) with 4.5 years of experience. Also got offers from few other companies for the same level. It took only one month to prepare with the great content of AlgoExpert. Thank you so much for creating such a great content and helping us to accelerate our SWE journey. I highly recommend SystemsExpert for anyone planning to land on FAANG and similar companies."
    },
    {
      "id": "74",
      "message": "Before SystemsExpert, I interviewed for an SDE II position at Amazon and was rejected, I believe largely due to bombing the systems design interview. SystemsExpert has everything you need for systems design interviews all in one very convenient place. After using SystemsExpert for a few weeks, I interviewed for Microsoft and got an offer! The systems design interview went from by far my weakest interview to one of my strongest. I recommend SystemsExpert to everyone interviewing for an engineering role in a big tech company."
    },
    {
      "id": "75",
      "message": "Hi Clement, just thought I'd share some great news - thanks almost entirely to AlgoExpert & SystemsExpert, I got an offer from Google, among others. I've accepted the offer! All this, In the midst of a global pandemic, whilst in Australia...and I'm self taught (or rather taught by people like you). This has been a crazy career change for me (and I'm 39 and a recovering lawyer!). So wanted to say a huge \"thank you\" to you, Antoine and the team. Your work makes this possible for everyone."
    },
    {
      "id": "76",
      "message": "Hi Clement, I would like to thank you immensely for your contents especially SystemsExpert. Your superb content helped me to crack Microsoft. This was my 4th attempt at Microsoft. Before this, I got rejected by Google (once), Amazon (twice). Your narration of each and every topic is awesome and very easy to understand. The topics covered are also great. Thank you again for the content. Keep on adding more. :)"
    },
    {
      "id": "77",
      "message": "G'day Clement (and team), thanks so much for all the effort you and the team put into the platform. AlgoExpert and SystemsExpert are great. The UI/UX is pleasant and user friendly and more importantly the content (especially, videos) is so easy to digest. I will be moving from Amazon as a Software Engineer II to Netflix as a Senior Software Engineer and I owe part of that to SystemsExpert which I used as a high level gateway to introduce me to topics I wanted to invest further in. Thanks again and good luck to you, your team and users in all of your pursuits."
    },
    {
      "id": "78",
      "message": "I never did system design before. I googled and saw 100s of videos & blogs to learn that for free. As a student, it feels safe to learn something for free. I wasted a week on that free content and got more confused. Luckily I saw SystemExpert's ad and risked buying the subscription. Now when I look back, that was the best decision I made. No one on the internet other than Clement can teach the basics and prepare you for what you will actually need in the interview. Without SystemsExpert, Bloomberg's system design interview would have been a tough thing to clear."
    },
    {
      "id": "79",
      "message": "AlgoExpert succeeds in a key area that other similar platforms fail by putting an emphasis on explaining the thought-process of each question. I'm not the type who wants to try and memorize 500 questions in hopes that my interview questions are ones that I have seen before - I want to really understand the concepts and patterns that would help me solve ANY question. AlgoExpert and SystemsExpert do a superb job of providing in-depth explanations of the patterns and thought that you should use to arrive at the correct solution, no matter the algorithm or design problem. I put my time and trust in AlgoExpert and I now have a job at Facebook to show for it. Highly recommended!"
    },
    {
      "id": "80",
      "message": "Coming from a nontraditional background with no boot-camp experience, if you're looking for a single resource to prep for technical interviews, this is it! What sets SystemsExpert apart from other providers is the deep coverage of different topics. Having both video and written explanations, along with easy-to-understand diagrams, these techniques help reinforce your learning experience, which is something I haven't found anywhere else. It takes abstract and complex ideas and breaks it down using real-world examples and covers many edge cases that aren't covered in other courses. Having an interview-style format for these topics gives you a better understanding of what to expect in an actual interview. Thank you SystemsExpert!!!"
    },
    {
      "id": "81",
      "message": "AlgoExpert was the backbone of my technical coding interview preparation. It allows you to efficiently work through the most common variations of problems asked by top-tier companies without having to spend hours 'battling' an algorithm only to come up with an inefficient or incorrect solution. There are a lot of resources available for repetition, but AlgoExpert differentiates its product by providing the 'how' and 'why' in clear and concise videos. Developing a deeper understanding of how to approach these problems is better than trying to memorize lines of code. I highly recommend AlgoExpert."
    },
    {
      "id": "82",
      "message": "As a scientist who was looking to break into Tech, I knew the underlying logic of programming, but I had a lot of gaps in my understanding, especially on the types of algorithms questions asked at interviews. I can confidently say that AlgoExpert is one of the best resources out there for interview preparation, with fantastic video tutorials and an excellent question selection that allows you to get a deep understanding of the topics and confidence in your problem solving ability. The site is incredibly intuitive to use and I think that the staff are some of the best out there, being incredibly supportive and passionate about offering a great customer experience. I cannot recommend AlgoExpert highly enough."
    },
    {
      "id": "83",
      "message": "I'm just writing to thank you for this product. I had failed in so many interviews before, but I wanted to get into a top tech company so much that I even enrolled in a Master's program. Even then, I was unsure if I had what it takes to make it. From the moment I heard your first video explanation, I thought 'this is exactly the way to solve an interview question' (plus the extra points you can grab by asking clarifying questions). After a few months of studying, mainly on AlgoExpert, I got offers to intern at Microsoft and Google!"
    },
    {
      "id": "84",
      "message": "I just accepted an offer with Palantir, and also received an offer from Amazon and a handful of startups. AlgoExpert does a great job selecting problems- many of my interview questions were variants of problems on the website. And when I came across problems I hadn't seen before, AlgoExpert gave me the tools to select the right data structures and identify patterns. Thanks AlgoExpert!"
    },
    {
      "id": "85",
      "message": "I just got a job offer from Oracle and most of the questions they asked, I had practiced on AlgoExpert. Even when they asked questions I was not familiar with, I was able to break down the problem and write code which I learned from the explanations section on AlgoExpert. Being a Computer Science Engineering student, I had fundamental knowledge in Data Structures & Algorithms, but I didn't know how to approach, break down and apply this knowledge to solve problems. Also since all the problems are classified into categories, I was able to easily identify my weak points and work on those. Extremely grateful to AlgoExpert !"
    },
    {
      "id": "86",
      "message": "The video explanations and detailed code examples on AlgoExpert have changed the way I approach coding problems. It has been an incredible asset during my career journey and I highly recommend it to anyone preparing for the job market."
    },
    {
      "id": "87",
      "message": "I've done Udemy, Udacity, Interview Cake, Educative, Egghead, Pluralsight, MIT OpenCourseWare, LeetCode, CodeSignal and various Youtube courses but this stuff that you all are putting out is among the best. Great work!"
    },
    {
      "id": "88",
      "message": "You can choose to spend your time scouring the internet for resources, or you can invest your money wisely and get as good a resource as you'll need. AlgoExpert is a big league product, with a high quality selection of algorithms and expert explanations. This is the best place to sharpen your problem solving skills on all the best material."
    },
    {
      "id": "89",
      "message": "Hey, just wanted to thank you for AlgoExpert! I signed up a few months back and I went through 60% of the problems. Before AlgoExpert I was awful at solving anything harder than a LeetCode easy, now I can do LeetCode mediums without much effort and tackle LeetCode hards in a reasonable time frame! I don’t think I would have gotten an internship without AlgoExpert, so thank you!"
    },
    {
      "id": "90",
      "message": "According to me landing on a dream job requires strong determination and continuous practice. But the most important thing is to find the right resource for the practice and I found AlgoExpert. Algoexpert provided me a platform to improve my thought process towards an algorithm question. It really helped me to shape my thinking skills and coding skills. I would definitely recommend to all the aspiring software engineers."
    },
    {
      "id": "91",
      "message": "There are thousands of practice problems out there, but AlgoExpert provides curation, in-depth explanation, code testing, and support for multiple programming languages. A lot of the problems even have multiple solutions. I'm very glad I invested in it, and even though I've already been hired, I'm still using it to keep my skills up."
    },
    {
      "id": "92",
      "message": "AlgoExpert was the best resource I used during my coding interview prep. Its structure, hand-picked questions, and detailed explanation videos really set it apart from other resources I tried. It helped me go into my interviews with confidence, allowing me to do well not only with small startups but also with big tech companies."
    },
    {
      "id": "93",
      "message": "I've tried a few of the algorithm learning resources and I think AlgoExpert is the best (and no I'm not being paid for this post). The site is super polished and offers a nice breadth of problems to get you best prepared with great solutions and video explanations. If you're on the job hunt, I think pairing AlgoExpert with an interviewing resource like Pramp and/or Interviewing.io is a great strategy."
    },
    {
      "id": "94",
      "message": "AlgoExpert helped me be confident in my interviews. Their curated list of questions and Clement's thorough review videos ensured that I was ready for anything thrown at me in onsite interviews. I highly recommend AlgoExpert to anyone looking to secure a tech job, or just brush up on their algorithm skills."
    },
    {
      "id": "95",
      "message": "As someone with no technical background, and fresh out of a coding bootcamp (shout-out to The Grace Hopper Program!), AlgoExpert was essential to my coding interview prep. The key to solving algorithms is to understand the how, why and patterns behind these problems. AlgoExpert made my life so much easier by providing all of this information in one place. I truly had a lot of fun working through these problems and solution videos!"
    },
    {
      "id": "96",
      "message": "I went from a self-taught, no degree developer to a software engineer at Facebook with only 115 hours of studying both SystemsExpert and AlgoExpert. I could not be any happier with how this has turned out. AlgoExpert has actually changed my life with this opportunity."
    },
    {
      "id": "97",
      "message": "AlgoExpert helped immensely when I was studying for my interviews. They managed to handpick the important, conceptually significant questions and provide awesome explanations for each one. I was able to land offers at Goldman Sachs, Uber, Amazon, and Microsoft, which would have been unthinkable even a few months prior. I owe the AlgoExpert team so much!"
    },
    {
      "id": "98",
      "message": "When I used to brute force the LeetCode grind, I struggled mightily to pass even the technical screens because I was memorizing and regurgitating information. When I gave AlgoExpert a shot, I was able to build a strong DS & Algorithms foundation and was able to develop a step-by-step framework to problem-solve my way to a solution. Combining with SystemsExpert and mock-interviews, I was able to pass FAANG interviews with ease I couldn't believe it! Thank you so much Clement! I couldn't have gotten my offers without your awesome product!"
    },
    {
      "id": "99",
      "message": "AlgoExpert is actually a fantastic product. I think it should be the first tool that any serious software engineer looking to get hired at a FAANG company should use. The curated set of problems, coupled with excellent video content on how to think about solving those problems, provides a solid foundation to tackle a wide range of similar problems across all relevant interview categories pertaining to DS&As and System Design."
    },
    {
      "id": "100",
      "message": "After failing technical interviews over and over again during my internship hunt, I decided to start using AlgoExpert alongside LeetCode. The user friendly UI and excellent explanation from Clement makes the learning experience very enjoyable, and I was able to make incredible progress. This year I crushed the Amazon interviews and received a new grad offer from them to work as a Software Development Engineer. Thank you AlgoExpert!"
    },
    {
      "id": "101",
      "message": "This platform is thoroughly awesome. I have to admit, I was very skeptical to purchase AlgoExpert and SystemsExpert at first. I was skeptical because of the price, and skeptical that I wouldn't learn anything more useful than I could find on other providers for free. After seeing a lot more talk of AlgoExpert online, I finally decided to at least take a look at the website. I was instantly drawn in by the delightful UI/UX, and the demo videos. I ended up taking a leap, and found that the platform is beautifully designed. Everything is extremely responsive, and the experience is just fun. The videos are viciously informative, and they tell us the \"why\" in extreme detail, followed up with the \"how\" for every type of problem. Also, I lastly vouch that these questions are indeed probably the 100 most valuable questions to anyone in a SWE interview process. Thanks Clement, you're a boss."
    },
    {
      "id": "102",
      "message": "Just wanted to thank you for building AlgoExpert!! It played a key role in helping me prepare for internship interviews and helped me land an offer with Facebook!"
    },
    {
      "id": "103",
      "message": "When I started preparing for interviews I could barely solve even the simplest problems. I was being rejected by every company I applied to. I went through all the mainstream resources, but while I could find plenty of problems to practice on, I couldn't find anything that actually helped me understand the right way to approach a problem and begin breaking it down. AlgoExpert's excellent videos were what really started to give me the intuition I needed - once I started using them, my performance took off and I got offers from a bunch of companies, including Amazon, Bloomberg, and Google."
    },
    {
      "id": "104",
      "message": "At first, I was unsure about AlgoExpert because there’s already a wide spectrum of free resource available online. Since I never really took an actual data structure and algo class, many of these existing resources were really difficult for me to follow. What’s awesome about AlgoExpert is that they have excellent explanations for problems that are generally found in actual interviews. It’s very in depth, from teaching you how to tackle the problems, to discussing trade offs with time/space complexities. Surprisingly, many resources out there don’t cover this crucial aspect! If I were to prepare for interviews again, I would go through AlgoExpert to brush up."
    },
    {
      "id": "105",
      "message": "As a student, I’m constantly preparing for technical interviews. Throughout applying to internships, I've used AlgoExpert to fill my knowledge gaps with invaluable material that my coursework at school never taught me. Unique to AlgoExpert are its curated video explanations that add an unparalleled level of personality which makes me feel as if the professor is actually in the room with me! Set yourself up for success and use AlgoExpert!"
    },
    {
      "id": "106",
      "message": "AlgoExpert got me from zero to ready in 6 weeks. While I bought other prep material, AlgoExpert was easily the best one because of its problem curation, whiteboard videos, optimized solutions, and edge-case testing. Everything I needed for a real interview setting!"
    },
    {
      "id": "107",
      "message": "AlgoExpert was very helpful during my interview prep. Having a curated list of problems helped organize my studying and ensured I was focused on the types of problems I would be asked. Great way to get in the necessary practice!"
    },
    {
      "id": "108",
      "message": "I'm very thrilled with AlgoExpert. Once I bought the subscription, I have never looked back. The content is exceptional and is a VERY good tool to have for studying for interviews. Since using AlgoExpert, I aced my interview with Capital One and accepted the offer the next day. The questions asked in the interview were easily manageable after completing all questions on this site. Before this site, DP was my kryptonite! Now, I can walk through the steps and solve those problems with time to spare! I highly recommend buying this and spending a FOCUSED two months studying. You'll have no problem achieving your goals after that!"
    },
    {
      "id": "109",
      "message": "I’ve tried both Interview Cake and AlgoExpert and have to say that AlgoExpert is a superior product. What I really like are the videos where logic is explained thoroughly with drawings— something that is extremely difficult to achieve with just text. AlgoExpert ended up saving me a ton of time in both gathering resources and understanding how to solve problems during the prep process."
    }
  ]
}